{
    "nodes":[
        {
            "image":"",
            "group":"Firer",
            "id":"Oleg Firer",
            "tooltip":"CEO of Net Element. Ambassador to Russia from Grenada",
        },
        {
            "image":"",
            "group":"criminal",
            "id":"Victor Wolf",
            "tooltip":"One half of husband and wife team. Swindled investors out of tens of millions. Fled the country in late 2006. ",
        },
        {
            "image":"",
            "group":"criminal",
            "id":"Natalia Wolf",
            "tooltip":"One half of husband and wife team. Swindled investors out of tens of millions. Fled the country in late 2006. ",
        },
        {
            "image":"",
            "group":"business",
            "id":"G & G Property Investments",
            "tooltip":"Real estate holding company.",
        },
        {
            "image":"",
            "group":"business",
            "id":"Star Capital Fund",
            "tooltip":"Umbrella name for several of Firer's investment companies.",
        },
        {
            "image":"",
            "group":"business",
            "id":"Merchant Processing Services",
            "tooltip":"Merchant account holder for Caviar Bar. ",
        },
        {
            "image":"",
            "group":"business",
            "id":"Net Element",
            "tooltip":"Nasdaq listed company. Stock price has fallen 98% since March, 2013. ",
        },
        {
            "image":"",
            "group":"business",
            "id":"Unified Payments",
            "tooltip":"One of Firer's credit card processing companies. Named the 2012 fastest growing company in America by Inc. Magazine",
        },
        {
            "image":"",
            "group":"criminal",
            "id":"Stanislav Pavlenko",
            "tooltip":"Longtime business associate of Firer. Co-conspirator in the Bar Girls scam.",
        },
        {
            "image":"",
            "group":"criminal",
            "id":"Albert Takhalov",
            "tooltip":"Merchant account agent. Co-conspirator in the Bar Girls scam.",
        },
        {
            "image":"",
            "group":"criminal",
            "id":"Michael Wachs",
            "tooltip":"Convicted of embezzling over $14.5 million from Chase Manhattan Bank.",
        },
        {
            "image":"",
            "group":"criminal",
            "id":"Felix Filenger",
            "tooltip":"Convicted of $23 million of insurance fraud.",
        }
    ],
    "links":[
        {
            "source":"Oleg Firer",
            "target":"G & G Property Investments",
            "relationship":"Oleg Firer was arrested for mortgage fraud when he attempted to buy G & G and Victor and Natalia Wolf's former home. Later public records show he eventually succeded in purchasing the company and the home."
        },
        {
            "source":"Oleg Firer",
            "target":"Star Capital Fund",
            "relationship":"Star Capital Fund businesses often invest in Net Element, Unified Payments and other Oleg Firer-connected companies. "
        },
        {
            "source":"Oleg Firer",
            "target":"Merchant Processing Services",
            "relationship":"One of Firer's credit card processing businesses. "
        },
        {
            "source":"Oleg Firer",
            "target":"Victor Wolf",
            "relationship":"Oleg Firer stated in a deposition that he had met and lunched with Victor Wolf to discuss a loan. Firer stated that he never provided this loan."
        },
        {
            "source":"Oleg Firer",
            "target":"Net Element",
            "relationship":"Oleg Firer has served as Net Element's CEO since 2013. Firer became CEO when Net Element bought Unified Payments."
        },
        {
            "source":"Oleg Firer",
            "target":"Felix Filenger",
            "relationship":"Oleg Firer and Felix Filenger are both involved with the Chabad Russian Center of South Florida. Firer submitted a letter of support to the judge in Filenger's insurance fraud case."
        },
        {
            "source":"Net Element",
            "target":"Michael Wachs",
            "relationship":"Companies associated with Michael Wachs and his relatives purchased millions of dollars worth of stock from Net Element. One of these companies, Crede CG III, is currently being prosecuted for stock price manipulation. "
        },
        {
            "source":"Net Element",
            "target":"Unified Payments",
            "relationship":"Net Element purchased Oleg Firer's Unified Payments in March 2013. Credit card processing continues to represent the lion's share of Net Element's revenue."
        },
        {
            "source":"Unified Payments",
            "target":"Albert Takhalov",
            "relationship":"Albert Takhalov runs Discover Data, a registered agent of Unified Payments. Part of his job is to source merchants and plug them into Unified Payments credit card processing system."
        },
        {
            "source":"G & G Property Investments",
            "target":"Natalia Wolf",
            "relationship":"Natalia Wolf entered into a $2.6 million mortgage agreement with G & G in early 2006. Within two and a half months, she added her home to the loan as extra collateral and subsequently transfered the home outright to G & G \"in lieu of foreclosure\" on the original mortgage.  "
        },
        {
            "source":"Natalia Wolf",
            "target":"Victor Wolf",
            "relationship":"Victor and Natalia Wolf wined and dined prospective investors in their Eastern Shores home. They made of with tens of millions of dollars and are both listed on the FBI's most wanted list for white collar crime. "
        },
        {
            "source":"Merchant Processing Services",
            "target":"Stanislav Pavlenko",
            "relationship":"Stanislav Pavlenko opened up the merchant account for Caviar Bar with Merchant Processing Services."
        },
        {
            "source":"Star Capital Fund",
            "target":"Stanislav Pavlenko",
            "relationship":"Stanislav Pavlenko testified that he was working at Star Capital Fund when he began conspiring in the Bar Girls scam."
        },
        {
            "source":"Stanislav Pavlenko",
            "target":"Albert Takhalov",
            "relationship":"Co-conspirators in the Bar Girls scam. Albert Takhalov testified that Stanislav Pavlenko introduced him to Oleg Firer."
        }
    ]
}
